'''
Задача 26:
Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

*Пример:*

A = 3; B = 5 -> 243 (3⁵)
A = 2; B = 3 -> 8 
'''

# while True:
#     A = input('Введите число А: ')
#     B = input('ВВедите число B: ')
#     if A.isdigit() == False:
#         print('Неверный тип A')
#     elif B.isdigit() == False:
#         print('Неверный тип B')
#     else:
#         break

# A = int(A)
# B = int(B)

# def MultiNumber(start,end):
#     if end==0: return 1
#     return (A * MultiNumber (start, end -1) )

# print(f'A = {A}; B = {B} -> {MultiNumber(A,B)}')

    